In [2]:
import mysql.connector
cnx = mysql.connector.connect(user='root', password='',
                              host='127.0.0.1',
                              use_pure=False)
print(cnx)
cursor = cnx.cursor()

# Show existing tables
cursor.execute("SHOW Databases")
for x in cursor:
    print(x)

<mysql.connector.connection_cext.CMySQLConnection object at 0x107f52530>
('NucleusTeq',)
('airlines_data',)
('information_schema',)
('mysql',)
('performance_schema',)
('phpmyadmin',)
('test',)

In [3]:
# cursor.execute("Create Database NucleusTeq")
cursor.execute("USE NucleusTeq")

In [4]:
# Exercise 1: Create a new table
create_table_query = """
CREATE TABLE IF NOT EXISTS employees (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(100),
    age INT,
    department VARCHAR(100)
)
"""
cursor.execute(create_table_query)

In [5]:
# Exercise 2: Insert data into the table
insert_data_query = """
INSERT INTO employees (name, age, department) VALUES
('John Doe', 30, 'IT'),
('Jane Smith', 35, 'HR'),
('Michael Johnson', 40, 'Finance')
"""
cursor.execute(insert_data_query)

In [24]:
cursor.execute("SHOW Tables")
for x in cursor:
    print(x)

('employees',)

In [6]:
select_data_query = """
SELECT * FROM employees
"""
cursor.execute(select_data_query)
rows = cursor.fetchall()

print("Employee Data:")
for row in rows:
    print(row)

Employee Data:
(4, 'John Doe', 30, 'IT')
(5, 'Jane Smith', 35, 'HR')
(6, 'Michael Johnson', 40, 'Finance')

In [7]:
update_data_query = """
UPDATE employees SET department = 'Operations' WHERE name = 'Michael Johnson'
"""
cursor.execute(update_data_query)

In [9]:
create_department_table_query = """
CREATE TABLE IF NOT EXISTS department (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(100),
    location VARCHAR(100)
)
"""
cursor.execute(create_department_table_query)

add_department_values_query = """
INSERT INTO department (name, location) VALUES
('IT', 'New York'),
('HR', 'London'),
('Finance', 'Paris')
"""
cursor.execute(add_department_values_query)

In [10]:
# Display 'department' table before update
print("Department Table (Before Update):")
cursor.execute("SELECT * FROM department")
rows = cursor.fetchall()
for row in rows:
    print(row)

Department Table (Before Update):
(1, 'IT', 'New York')
(2, 'HR', 'London')
(3, 'Finance', 'Paris')

In [11]:
# Perform update commands
update_department_query = """
UPDATE department SET location = 'Tokyo' WHERE name = 'HR'
"""
cursor.execute(update_department_query)

# Display 'department' table after update
print("\nDepartment Table (After Update):")
cursor.execute("SELECT * FROM department")
rows = cursor.fetchall()
for row in rows:
    print(row)

Department Table (After Update):
(1, 'IT', 'New York')
(2, 'HR', 'Tokyo')
(3, 'Finance', 'Paris')

In [12]:
# Perform select command
print("\nSelecting Data from 'department' Table:")
cursor.execute("SELECT * FROM department WHERE location = 'New York'")
rows = cursor.fetchall()
for row in rows:
    print(row)

Selecting Data from 'department' Table:
(1, 'IT', 'New York')

In [13]:
delete_department_query = """
DELETE FROM department WHERE name = 'Finance'
"""
cursor.execute(delete_department_query)

# Display 'department' table after delete
print("\nDepartment Table (After Delete):")
cursor.execute("SELECT * FROM department")
rows = cursor.fetchall()
for row in rows:
    print(row)

Department Table (After Delete):
(1, 'IT', 'New York')
(2, 'HR', 'Tokyo')

In [14]:
# Perform inner join between 'department' and 'employees'
join_query = """
SELECT e.name as employee_name, e.age, e.department as employee_department, d.name as department_name, d.location
FROM employees e
INNER JOIN department d ON e.department = d.name
"""
cursor.execute(join_query)
rows = cursor.fetchall()

print("Employee Details with Department Information:")
for row in rows:
    print(row)

Employee Details with Department Information:
('John Doe', 30, 'IT', 'IT', 'New York')
('Jane Smith', 35, 'HR', 'HR', 'Tokyo')